---
kind: other
id: Properties.T:Autodesk.Revit.DB.Lighting.LightDistribution
source: html/ffc26f76-95bb-ade1-4240-ad36f815ec29.htm
---
# LightDistribution Properties

Specifies whether the .NET object represents a valid Revit entity.